server/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://www.example.com/okomes">
    <soapenv:Header />
    <soapenv:Body>
        <gs:getHinshuRequest>
            <gs:id>1</gs:id>
        </gs:getHinshuRequest>
    </soapenv:Body>
</soapenv:Envelope>